# Сначала программа должна спросить, был ли стол зарезервирован/нет (предоставляя ваше полное имя). И тогда, если бы не
# назначили вам стол (есть определенное количество одноместных, двухместных или семейных столов). После того, как стол
# будет назначен вам, система должна показать, сколько свободных столов и сколько зарезервировано/занято. Система должна
# иметь возможность отображать имя/фамилию лица зарезервированного стола (опция CLI: введите номер зарезервированного
# стола; РЕЗУЛЬТАТ: имя/фамилия/время зарезервировано)
# После назначения стола система должна показать разные варианты меню на завтрак, обед, ужин, напитки (алкоголь,
# безалкогольное) на выбор. Специальное меню для вегетарианцев и веганов также должно быть включено в специальное меню.
# Все позиции меню должны иметь вес, время приготовления в минутах, калорийность и цену.
# У меня должна быть возможность изменить заказ перед разделом оплаты. Таким образом я могу удалять, добавлять,
# обновлять сумму одного и того же заказа.
# Я должен иметь возможность выбирать все, что хочу, из всех меню в одном заказе. После того, как я закончу, мне нужно
# увидеть, что я выбрал, полную сумму к оплате и приблизительное время ожидания подачи еды.
# Добавить возможность добавления чаевых (% от полной стоимости) к окончательному счету.
# После оплаты система должна сгенерировать квитанцию ​​(логирование).
